aehoppe/E70N19_Dev_Board/atsame70n19/include/component/afec.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AFEC_TEMPCWR_OFFSET                 (0x74)                                        /**<  (AFEC_TEMPCWR) AFEC Temperature Compare Window Register  Offset */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))

#define AFEC_TEMPCWR_TLOWTHRES_Pos          0                                              /**< (AFEC_TEMPCWR) Temperature Low Threshold Position */
#define AFEC_TEMPCWR_TLOWTHRES_Msk          (0xFFFFU << AFEC_TEMPCWR_TLOWTHRES_Pos)        /**< (AFEC_TEMPCWR) Temperature Low Threshold Mask */
#define AFEC_TEMPCWR_TLOWTHRES(value)       (AFEC_TEMPCWR_TLOWTHRES_Msk & ((value) << AFEC_TEMPCWR_TLOWTHRES_Pos))
#define AFEC_TEMPCWR_THIGHTHRES_Pos         16                                             /**< (AFEC_TEMPCWR) Temperature High Threshold Position */
#define AFEC_TEMPCWR_THIGHTHRES_Msk         (0xFFFFU << AFEC_TEMPCWR_THIGHTHRES_Pos)       /**< (AFEC_TEMPCWR) Temperature High Threshold Mask */
#define AFEC_TEMPCWR_THIGHTHRES(value)      (AFEC_TEMPCWR_THIGHTHRES_Msk & ((value) << AFEC_TEMPCWR_THIGHTHRES_Pos))
#define AFEC_TEMPCWR_MASK                   (0xFFFFFFFFU)                                  /**< \deprecated (AFEC_TEMPCWR) Register MASK  (Use AFEC_TEMPCWR_Msk instead)  */
#define AFEC_TEMPCWR_Msk                    (0xFFFFFFFFU)                                  /**< (AFEC_TEMPCWR) Register Mask  */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */


/* -------- AFEC_ACR : (AFEC Offset: 0x94) (R/W 32) AFEC Analog Control Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t :2;                        /**< bit:   0..1  Reserved */
    uint32_t PGA0EN:1;                  /**< bit:      2  PGA0 Enable                              */
    uint32_t PGA1EN:1;                  /**< bit:      3  PGA1 Enable                              */
    uint32_t :4;                        /**< bit:   4..7  Reserved */
    uint32_t IBCTL:2;                   /**< bit:   8..9  AFE Bias Current Control                 */
    uint32_t :22;                       /**< bit: 10..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} AFEC_ACR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AFEC_ACR_OFFSET                     (0x94)                                        /**<  (AFEC_ACR) AFEC Analog Control Register  Offset */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))

#define AFEC_ACR_PGA0EN_Pos                 2                                              /**< (AFEC_ACR) PGA0 Enable Position */
#define AFEC_ACR_PGA0EN_Msk                 (0x1U << AFEC_ACR_PGA0EN_Pos)                  /**< (AFEC_ACR) PGA0 Enable Mask */
#define AFEC_ACR_PGA0EN                     AFEC_ACR_PGA0EN_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_ACR_PGA0EN_Msk instead */
#define AFEC_ACR_PGA1EN_Pos                 3                                              /**< (AFEC_ACR) PGA1 Enable Position */
#define AFEC_ACR_PGA1EN_Msk                 (0x1U << AFEC_ACR_PGA1EN_Pos)                  /**< (AFEC_ACR) PGA1 Enable Mask */
#define AFEC_ACR_PGA1EN                     AFEC_ACR_PGA1EN_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_ACR_PGA1EN_Msk instead */
#define AFEC_ACR_IBCTL_Pos                  8                                              /**< (AFEC_ACR) AFE Bias Current Control Position */
#define AFEC_ACR_IBCTL_Msk                  (0x3U << AFEC_ACR_IBCTL_Pos)                   /**< (AFEC_ACR) AFE Bias Current Control Mask */
#define AFEC_ACR_IBCTL(value)               (AFEC_ACR_IBCTL_Msk & ((value) << AFEC_ACR_IBCTL_Pos))
#define AFEC_ACR_MASK                       (0x30CU)                                       /**< \deprecated (AFEC_ACR) Register MASK  (Use AFEC_ACR_Msk instead)  */
#define AFEC_ACR_Msk                        (0x30CU)                                       /**< (AFEC_ACR) Register Mask  */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */


/* -------- AFEC_SHMR : (AFEC Offset: 0xa0) (R/W 32) AFEC Sample & Hold Mode Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t DUAL0:1;                   /**< bit:      0  Dual Sample & Hold for channel 0         */
    uint32_t DUAL1:1;                   /**< bit:      1  Dual Sample & Hold for channel 1         */
    uint32_t DUAL2:1;                   /**< bit:      2  Dual Sample & Hold for channel 2         */
    uint32_t DUAL3:1;                   /**< bit:      3  Dual Sample & Hold for channel 3         */
    uint32_t DUAL4:1;                   /**< bit:      4  Dual Sample & Hold for channel 4         */
    uint32_t DUAL5:1;                   /**< bit:      5  Dual Sample & Hold for channel 5         */
    uint32_t DUAL6:1;                   /**< bit:      6  Dual Sample & Hold for channel 6         */
    uint32_t DUAL7:1;                   /**< bit:      7  Dual Sample & Hold for channel 7         */
    uint32_t DUAL8:1;                   /**< bit:      8  Dual Sample & Hold for channel 8         */
    uint32_t DUAL9:1;                   /**< bit:      9  Dual Sample & Hold for channel 9         */
    uint32_t DUAL10:1;                  /**< bit:     10  Dual Sample & Hold for channel 10        */
    uint32_t DUAL11:1;                  /**< bit:     11  Dual Sample & Hold for channel 11        */
    uint32_t :20;                       /**< bit: 12..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t DUAL:12;                   /**< bit:  0..11  Dual Sample & Hold for channel xx        */
    uint32_t :20;                       /**< bit: 12..31 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} AFEC_SHMR_Type;
