aehoppe/E70N19_Dev_Board/atsame70n19/include/component/afec.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AFEC_SHMR_OFFSET                    (0xA0)                                        /**<  (AFEC_SHMR) AFEC Sample & Hold Mode Register  Offset */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))

#define AFEC_SHMR_DUAL0_Pos                 0                                              /**< (AFEC_SHMR) Dual Sample & Hold for channel 0 Position */
#define AFEC_SHMR_DUAL0_Msk                 (0x1U << AFEC_SHMR_DUAL0_Pos)                  /**< (AFEC_SHMR) Dual Sample & Hold for channel 0 Mask */
#define AFEC_SHMR_DUAL0                     AFEC_SHMR_DUAL0_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_SHMR_DUAL0_Msk instead */
#define AFEC_SHMR_DUAL1_Pos                 1                                              /**< (AFEC_SHMR) Dual Sample & Hold for channel 1 Position */
#define AFEC_SHMR_DUAL1_Msk                 (0x1U << AFEC_SHMR_DUAL1_Pos)                  /**< (AFEC_SHMR) Dual Sample & Hold for channel 1 Mask */
#define AFEC_SHMR_DUAL1                     AFEC_SHMR_DUAL1_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_SHMR_DUAL1_Msk instead */
#define AFEC_SHMR_DUAL2_Pos                 2                                              /**< (AFEC_SHMR) Dual Sample & Hold for channel 2 Position */
#define AFEC_SHMR_DUAL2_Msk                 (0x1U << AFEC_SHMR_DUAL2_Pos)                  /**< (AFEC_SHMR) Dual Sample & Hold for channel 2 Mask */
#define AFEC_SHMR_DUAL2                     AFEC_SHMR_DUAL2_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_SHMR_DUAL2_Msk instead */
#define AFEC_SHMR_DUAL3_Pos                 3                                              /**< (AFEC_SHMR) Dual Sample & Hold for channel 3 Position */
#define AFEC_SHMR_DUAL3_Msk                 (0x1U << AFEC_SHMR_DUAL3_Pos)                  /**< (AFEC_SHMR) Dual Sample & Hold for channel 3 Mask */
#define AFEC_SHMR_DUAL3                     AFEC_SHMR_DUAL3_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_SHMR_DUAL3_Msk instead */
#define AFEC_SHMR_DUAL4_Pos                 4                                              /**< (AFEC_SHMR) Dual Sample & Hold for channel 4 Position */
#define AFEC_SHMR_DUAL4_Msk                 (0x1U << AFEC_SHMR_DUAL4_Pos)                  /**< (AFEC_SHMR) Dual Sample & Hold for channel 4 Mask */
#define AFEC_SHMR_DUAL4                     AFEC_SHMR_DUAL4_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_SHMR_DUAL4_Msk instead */
#define AFEC_SHMR_DUAL5_Pos                 5                                              /**< (AFEC_SHMR) Dual Sample & Hold for channel 5 Position */
#define AFEC_SHMR_DUAL5_Msk                 (0x1U << AFEC_SHMR_DUAL5_Pos)                  /**< (AFEC_SHMR) Dual Sample & Hold for channel 5 Mask */
#define AFEC_SHMR_DUAL5                     AFEC_SHMR_DUAL5_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_SHMR_DUAL5_Msk instead */
#define AFEC_SHMR_DUAL6_Pos                 6                                              /**< (AFEC_SHMR) Dual Sample & Hold for channel 6 Position */
#define AFEC_SHMR_DUAL6_Msk                 (0x1U << AFEC_SHMR_DUAL6_Pos)                  /**< (AFEC_SHMR) Dual Sample & Hold for channel 6 Mask */
#define AFEC_SHMR_DUAL6                     AFEC_SHMR_DUAL6_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_SHMR_DUAL6_Msk instead */
#define AFEC_SHMR_DUAL7_Pos                 7                                              /**< (AFEC_SHMR) Dual Sample & Hold for channel 7 Position */
#define AFEC_SHMR_DUAL7_Msk                 (0x1U << AFEC_SHMR_DUAL7_Pos)                  /**< (AFEC_SHMR) Dual Sample & Hold for channel 7 Mask */
#define AFEC_SHMR_DUAL7                     AFEC_SHMR_DUAL7_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_SHMR_DUAL7_Msk instead */
#define AFEC_SHMR_DUAL8_Pos                 8                                              /**< (AFEC_SHMR) Dual Sample & Hold for channel 8 Position */
#define AFEC_SHMR_DUAL8_Msk                 (0x1U << AFEC_SHMR_DUAL8_Pos)                  /**< (AFEC_SHMR) Dual Sample & Hold for channel 8 Mask */
#define AFEC_SHMR_DUAL8                     AFEC_SHMR_DUAL8_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_SHMR_DUAL8_Msk instead */
#define AFEC_SHMR_DUAL9_Pos                 9                                              /**< (AFEC_SHMR) Dual Sample & Hold for channel 9 Position */
#define AFEC_SHMR_DUAL9_Msk                 (0x1U << AFEC_SHMR_DUAL9_Pos)                  /**< (AFEC_SHMR) Dual Sample & Hold for channel 9 Mask */
#define AFEC_SHMR_DUAL9                     AFEC_SHMR_DUAL9_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_SHMR_DUAL9_Msk instead */
#define AFEC_SHMR_DUAL10_Pos                10                                             /**< (AFEC_SHMR) Dual Sample & Hold for channel 10 Position */
#define AFEC_SHMR_DUAL10_Msk                (0x1U << AFEC_SHMR_DUAL10_Pos)                 /**< (AFEC_SHMR) Dual Sample & Hold for channel 10 Mask */
#define AFEC_SHMR_DUAL10                    AFEC_SHMR_DUAL10_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_SHMR_DUAL10_Msk instead */
#define AFEC_SHMR_DUAL11_Pos                11                                             /**< (AFEC_SHMR) Dual Sample & Hold for channel 11 Position */
#define AFEC_SHMR_DUAL11_Msk                (0x1U << AFEC_SHMR_DUAL11_Pos)                 /**< (AFEC_SHMR) Dual Sample & Hold for channel 11 Mask */
#define AFEC_SHMR_DUAL11                    AFEC_SHMR_DUAL11_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_SHMR_DUAL11_Msk instead */
#define AFEC_SHMR_DUAL_Pos                  0                                              /**< (AFEC_SHMR Position) Dual Sample & Hold for channel xx */
#define AFEC_SHMR_DUAL_Msk                  (0xFFFU << AFEC_SHMR_DUAL_Pos)                 /**< (AFEC_SHMR Mask) DUAL */
#define AFEC_SHMR_DUAL(value)               (AFEC_SHMR_DUAL_Msk & ((value) << AFEC_SHMR_DUAL_Pos))  
#define AFEC_SHMR_MASK                      (0xFFFU)                                       /**< \deprecated (AFEC_SHMR) Register MASK  (Use AFEC_SHMR_Msk instead)  */
#define AFEC_SHMR_Msk                       (0xFFFU)                                       /**< (AFEC_SHMR) Register Mask  */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */


